#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдресСервера	= "api.unisender.com/ru/api";
	КлючАпи			= РеквизитФормыВЗначение("Объект").КлючАпи();	 
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаСервере
Процедура getListsНаСервере()
	ОбработкаОбъект	= РеквизитФормыВЗначение("Объект");
	строкаОтветаСервера	= ОбработкаОбъект.getLists();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура getLists(Команда)
	getListsНаСервере();
КонецПроцедуры


&НаСервере
Процедура createListНаСервере()
	ОбработкаОбъект	= РеквизитФормыВЗначение("Объект");
	СтруктураРеквизиты	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ГруппаРассылки, "Наименование");
	строкаОтветаСервера	= ОбработкаОбъект.createList(СтруктураРеквизиты.Наименование);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры


&НаКлиенте
Процедура createList(Команда)
	Если Не ЗначениеЗаполнено(ГруппаРассылки) Тогда
		ПоказатьПредупреждение(, "Выберите группу для создания");
		Возврат;
	КонецЕсли; 
	createListНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОтправитьЗапросСервер()
	ОбработкаОбъект	= РеквизитФормыВЗначение("Объект");
	строкаОтветаСервера	= ОбработкаОбъект.ЗапросНаСервер(ИмяСкрипта, Объект.СтрокаЗапросаНаСервер);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры
 
&НаКлиенте
Процедура ОтправитьЗапрос()
	ОтправитьЗапросСервер();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеСпискаРассылкиНаСервере()
	ОбработкаОбъект	= РеквизитФормыВЗначение("Объект");
	МассивГруппРассылки	= Новый Массив;
	МассивГруппРассылки.Добавить(ГруппаРассылки);
	ОбработкаОбъект.ОбновитьДанныеСпискаРассылки(МассивГруппРассылки, КодСпискаРассылки);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеСпискаРассылки(Команда)
	Если Не ЗначениеЗаполнено(ГруппаРассылки) ИЛИ Не ЗначениеЗаполнено(КодСпискаРассылки) Тогда
		ПоказатьПредупреждение(, "Выберите группу и код рассылки");
		Возврат;
	КонецЕсли; 
	ОбновитьДанныеСпискаРассылкиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти





 